{
  "about": "about",
  "available": "I am available for freelance or full-time positions. Contact me and let's talk.",
  "back": "back",
  "cani": "I built this app in Next JS. Initially it was a freelance job and I had to do it a little fast so I used some packages like Swiper for a very modern and beautiful image carousel, EmailJs for a full backend email sending service. The Tailwind CSS framework was used for the responsive design and styling.",
  "check": "Check out some of my latest projects",
  "code": "code",
  "con": "CONNECT WITH ME",
  "contact": "CONTACT",
  "email": "email",
  "front": "Front-End Developer",
  "frontend": "A Front-End Developer",
  "hi": "Hi, I'm",
  "i_build": "What I've Build",
  "i_do": "What I Can Do",
  "lets_build": "Let's build",
  "message": "message",
  "miniblog": "I built this app in React JS and it's a post database on Firebase. This app features user authentication with Firebase as well as cloud storage database. This app is extracting data from each user's individual posts. Only authenticated users can create their own posts with their respective username, hashtags, title and description. Posts will be pulled from the database and displayed publicly to those who do not have an account. The user's Dashboard, has the option of the user to edit their posts, delete or view them. The useContext hook has been implemented for the filter that allows only authenticated users to create posts",
  "minindex": "I'm a front-end web developer specializing in building (and occasionally designing) exceptional digital experiences. Currently, I'm focused on bulding responsive fron-end web applications while learning back-end technologies",
  "more": "more info",
  "name": "name",
  "netflix": "I built this app in React JS. This app features user authentication with Firebase as well as cloud storage database. This app is pulling movie data from IMDB API and displaying different categories. It features horizontal swiping and a favorite section for each user. The useContext hook is also being implemented for the filter that allows only authenticated users to save movies in the favorite section.",
  "normal": "I am not your normal developer",
  "over": "Overview",
  "phone": "phone",
  "project": "Project",
  "projects": "projects",
  "resume": "My name is João Marcos A. Azeredo, I was born in 1993 in the city of Rio de Janeiro - RJ. I have always been very connected to technology, after all, I was born in the decade when the population began to have access to computers and the internet. I got to know the technology area, more precisely, Web Development, in 2014 when I started my BS in Systems Analysis. I worked in other areas and it wasn't until 2022 that I got back to working with HTML & CSS to make some minor edits on a small business website I was operating. What I thought would be a few minor edits turned into love for programming",
  "secret_w": "I built this app in React JS. A lot of programming logic was used to define a maximum number of attempts, letters already used and letters that were guessed from the word, the game's score, and finally the import of a database of words in JSON. The useCallback hook was used to monitor the JSON file data preventing rendering and through a loop, transform the data into two objects containing a word and a random category.",
  "send": "send message",
  "skills": "skills",
  "subject": "subject",
  "tech": "Technologies",
  "together": "together",
  "touch": "Get In Touch",
  "who": "Who I Am"
}
